highloadTest/wrk2/get.txt
wrk -t1 -c1 -d10s -R2000 --latency -s wrk2/getScript.lua http://127.0.0.1:8080

Running 10s test @ http://127.0.0.1:8080
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.67ms    8.90ms  58.50ms   93.30%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.70ms
 90.000%    6.40ms
 99.000%   51.33ms
 99.900%   57.22ms
 99.990%   58.37ms
 99.999%   58.53ms
100.000%   58.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.036     0.000000            1         1.00
       0.442     0.100000         2003         1.11
       0.652     0.200000         4005         1.25
       0.837     0.300000         6004         1.43
       0.997     0.400000         8011         1.67
       1.136     0.500000         9999         2.00
       1.208     0.550000        11002         2.22
       1.287     0.600000        12002         2.50
       1.390     0.650000        13008         2.86
       1.531     0.700000        14003         3.33
       1.700     0.750000        14998         4.00
       1.797     0.775000        15498         4.44
       1.915     0.800000        16001         5.00
       2.103     0.825000        16500         5.71
       2.995     0.850000        16999         6.67
       4.131     0.875000        17500         8.00
       4.859     0.887500        17748         8.89
       6.403     0.900000        17998        10.00
       8.583     0.912500        18248        11.43
      10.559     0.925000        18499        13.33
      14.311     0.937500        18749        16.00
      17.823     0.943750        18874        17.78
      23.343     0.950000        18998        20.00
      25.903     0.956250        19124        22.86
      29.903     0.962500        19248        26.67
      34.079     0.968750        19374        32.00
      35.999     0.971875        19435        35.56
      38.815     0.975000        19499        40.00
      40.991     0.978125        19560        45.71
      43.071     0.981250        19624        53.33
      44.287     0.984375        19685        64.00
      46.495     0.985938        19716        71.11
      48.927     0.987500        19748        80.00
      50.559     0.989062        19779        91.43
      52.159     0.990625        19810       106.67
      53.375     0.992188        19842       128.00
      53.887     0.992969        19859       142.22
      54.175     0.993750        19873       160.00
      54.463     0.994531        19888       182.86
      54.655     0.995313        19910       213.33
      54.719     0.996094        19919       256.00
      54.879     0.996484        19928       284.44
      55.039     0.996875        19937       320.00
      55.167     0.997266        19943       365.71
      55.487     0.997656        19951       426.67
      55.903     0.998047        19958       512.00
      56.191     0.998242        19962       568.89
      56.575     0.998437        19966       640.00
      56.735     0.998633        19970       731.43
      56.927     0.998828        19974       853.33
      57.215     0.999023        19978      1024.00
      57.407     0.999121        19980      1137.78
      57.567     0.999219        19982      1280.00
      57.663     0.999316        19986      1462.86
      57.663     0.999414        19986      1706.67
      57.823     0.999512        19988      2048.00
      57.919     0.999561        19989      2275.56
      58.015     0.999609        19990      2560.00
      58.111     0.999658        19992      2925.71
      58.111     0.999707        19992      3413.33
      58.175     0.999756        19993      4096.00
      58.175     0.999780        19993      4551.11
      58.271     0.999805        19994      5120.00
      58.271     0.999829        19994      5851.43
      58.367     0.999854        19995      6826.67
      58.367     0.999878        19995      8192.00
      58.367     0.999890        19995      9102.22
      58.463     0.999902        19996     10240.00
      58.463     0.999915        19996     11702.86
      58.463     0.999927        19996     13653.33
      58.463     0.999939        19996     16384.00
      58.463     0.999945        19996     18204.44
      58.527     0.999951        19997     20480.00
      58.527     1.000000        19997          inf
#[Mean    =        3.671, StdDeviation   =        8.902]
#[Max     =       58.496, Total count    =        19997]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  19998 requests in 10.00s, 1.37MB read
  Non-2xx or 3xx responses: 2
Requests/sec:   1999.82
Transfer/sec:    140.50KB